os/dispatcher.html
---
layout: page
title: Dispatcher
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Dispatcher</h2>
<div class="outline-text-2" id="text-1">
<p>
Als Dispatcher bezeichnet man die Betriebssystemroutine, die Context
Switches ausführt, also dem Running Process die CPU entzieht und sie dem
als nächstes auszuführenden Prozess (vom Scheduler festgelegt) zuteilt.
Konkret führt der Deispatcher folgene Aufgaben aus:
</p>

<ol class="org-ol">
<li>Ordered List ItemSpeicherung des Kontexts des Running Process
(Register, Stack Pointer, Program Counter, Page Table Pointer, etc.)
</li>
<li>Wiederherstellung des Kontexts des als nächstes auszuführenden
Prozesses (Registerinhalte, Stack Pointer, Program Counter, Page
Table Pointer, etc. werden aus dem
<i>Process
Control Block</i> des Prozesses geladen).
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Dispatch Latency</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Zeit, die der Dispatcher benötigt, um einen running Prozess zu stoppen
und den nächsten Prozess zu starten.
</p>
</div>
</div>
</div>
